sysbench/io/dockerVM_io_data.log
sysbench 1.0.18 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 1
Initializing random number generator from current time


Extra file open flags: (none)
128 files, 40MiB each
5GiB total file size
Block size 16KiB
Number of IO requests: 0
Read/Write ratio for combined random IO test: 1.50
Periodic FSYNC enabled, calling fsync() each 100 requests.
Calling fsync() at the end of test, Enabled.
Using synchronous I/O mode
Doing random r/w test
Initializing worker threads...

Threads started!


File operations:
    reads/s:                      1507.07
    writes/s:                     1004.72
    fsyncs/s:                     3215.35

Throughput:
    read, MiB/s:                  23.55
    written, MiB/s:               15.70

General statistics:
    total time:                          300.0232s
    total number of events:              1718157

Latency (ms):
         min:                                    0.00
         avg:                                    0.17
         max:                                   19.14
         95th percentile:                        0.78
         sum:                               298888.54

Threads fairness:
    events (avg/stddev):           1718157.0000/0.00
    execution time (avg/stddev):   298.8885/0.00